In [4]:
import pandas as pd

autiDF = pd.read_csv('datasources/auti.csv')

autiDF['title'] = autiDF['title'].str.strip()

display(autiDF)

,id,title,price,url
0,0,Opel Astra 1.4,750,www.google.com
1,1,Alpina 20 zamjena za auto ili skuter,2.000,www.google.com
2,2,Renault Twingo 1.5 DCI,5.500,www.google.com
3,3,Audi A6 2.0tdi ultra,18.900,www.google.com
4,4,Fiat Panda 1.2 ☆ 4 x 4 ☆ CLIMBING ☆KLIMA☆KUKA...,5.400,www.google.com
...,...,...,...,...
95,95,Audi A4 B7 3.0 TDI QUATTRO,5.650,www.google.com
96,96,"Renault Espace 1.6dci, 2016g.reg 8/2023, full ...",15.999,www.google.com
97,97,⭕ Ford Fiesta 1.1 Kupljen nov u HR Samo 24.0...,11.900,www.google.com
98,98,VW PASSAT 2.0 TDI*110KW/150KS*REG 3/24*AUT KLI...,16.000,www.google.com
99,99,BMW serija 3 2.0,"5,00",www.google.com

In [5]:
# https://www.apachefriends.org/
# MariaDB & phpMyAdmin

import sqlite3
conn = sqlite3.connect(':memory:') # https://docs.python.org/3/library/sqlite3.html#sqlite3.connect

# https://www.w3schools.com/sql/sql_syntax.asp
conn.execute("CREATE TABLE cars(id, title, price, url)")

sql = f""" INSERT INTO cars VALUES
        ({autiDF.loc[0]['id']}, "{autiDF.loc[0]['title']}", {autiDF.loc[0]['price']}, "{autiDF.loc[0]['url']}")
"""
print("SQL: "+sql)
conn.execute(sql)
res = conn.execute("SELECT id, title, price FROM cars")

display(res.fetchall())

SQL:  INSERT INTO cars VALUES
        (0, "Opel Astra 1.4", 750 , "www.google.com")

[(0, 'Opel Astra 1.4', 750)]

In [8]:
res = conn.execute("SELECT title, price FROM cars")
display(res.fetchall())

[('Opel Astra 1.4', 750)]

In [19]:
import sqlite3
# https://www.tutorialspoint.com/sqlite/sqlite_python.htm#:~:text=To%20use%20sqlite3%20module%2C%20you,executing%20all%20the%20SQL%20statements.

conn = sqlite3.connect('./assets/my_database')
print("Opened database successfully");

# https://www.w3schools.com/sql/sql_syntax.asp
conn.execute("""CREATE TABLE IF NOT EXISTS COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);""")

try:
    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
          VALUES (1, 'Paul', 32, 'California', 20000.00 )");

    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
          VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
          VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
          VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

    conn.commit()

except sqlite3.IntegrityError:
    print("Item IDs are not unique. Skipping...")
conn.close()

Opened database successfully
Item IDs are not unique. Skipping...

In [2]:
conn = sqlite3.connect('./assets/my_database')

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])

ID =  1
NAME =  Paul
ID =  2
NAME =  Allen
ID =  3
NAME =  Teddy
ID =  4
NAME =  Mark